### `using column name having space in it is bad idea`

### `because, u now lose the ability to acces the column using  .  syntax`

In [1]:
import pandas as pd

In [2]:
# dictionary data

data= {
    'Jobs': ['Hitman', 'IT', 'Machine'],
    
    'Bingo Bang': ['Agent47', 'Analyst', 'Mechanics']
}

In [3]:
# Create the DataFrame using dicitionary data

df = pd.DataFrame(data)

In [4]:
df

      Jobs Bingo Bang
0   Hitman    Agent47
1       IT    Analyst
2  Machine  Mechanics

### cannot access column using ` . ` syntax

In [5]:
# below code is right, but it throws SyntaxError (because there is space in the column name)
df.Bingo Bang

SyntaxError: invalid syntax (863944178.py, line 2)

### better/preferable to use ` _ underscore` in place of space in column name

In [6]:
# dictionary data

data= {
    'Jobs': ['Hitman', 'IT', 'Machine'],
    
    'Bingo_Bang': ['Agent47', 'Analyst', 'Mechanics']
}

In [7]:
df2 = pd.DataFrame(data)

In [8]:
df2

      Jobs Bingo_Bang
0   Hitman    Agent47
1       IT    Analyst
2  Machine  Mechanics

In [9]:
# now, can easily access column name having underscore in the place of space

df2.Bingo_Bang

0      Agent47
1      Analyst
2    Mechanics
Name: Bingo_Bang, dtype: object